tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Glorious Glasgow Haskell Compilation System
brew "ghc", link: false
# Command-line interface for Cabal and Hackage
brew "cabal-install", link: false
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Load/unload environment variables based on $PWD
brew "direnv"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Git extension for versioning large files
brew "git-lfs"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# Autoformat shell script source code
brew "shfmt"
# Secure Programming Lint
brew "splint"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Vi 'workalike' with many additional features
brew "vim"
# UNIX shell (command interpreter)
brew "zsh"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "wkhtmltopdf"
