tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Glorious Glasgow Haskell Compilation System
brew "ghc", link: false
# Command-line interface for Cabal and Hackage
brew "cabal-install", link: false
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Load/unload environment variables based on $PWD
brew "direnv"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Git extension for versioning large files
brew "git-lfs"
# Core application library for C
brew "glib"
# Drop-in replacement for MySQL
brew "mariadb"
# Java-based project management
brew "maven"
# Cross platform, open source .NET development framework
brew "mono", link: false
# Text-based UI library
brew "ncurses"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node", link: false
# Manage compile and link flags for libraries
brew "pkg-config"
# Autoformat shell script source code
brew "shfmt"
# Secure Programming Lint
brew "splint"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
cask "logmein-hamachi"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
