{"id":98943,"xmlId":"com.intellij.bigdatatools","name":"Big Data Tools","description":"\n    <p>\n      With this plugin, you can conveniently work with <b>Zeppelin</b> notebooks,, monitor <b>Spark</b> and <b>Hadoop</b> applications,\n      and preview <a href=\"https://aws.amazon.com/s3/\">AWS S3</a>,\n      <a href=\"https://cloud.google.com/storage\">Google Cloud Storage</a>,\n      <a href=\"https://min.io/\">Minio</a>,\n      <a href=\"https://www.linode.com/\">Linode</a>,\n      <a href=\"https://www.digitalocean.com/products/spaces/\">Digital Open Space</a>,\n      <a href=\"https://azure.microsoft.com/en-us/\">Microsoft Azure</a>, and\n      <a href=\"https://hadoop.apache.org/docs/r1.2.1/hdfs_design.html\">Hadoop Distributed File System files</a> right from IntelliJ-based IDEs including\n      <b>IntelliJ IDEA Ultimate, PyCharm Professional, and DataGrip.</b>\n    </p>\n    <br>\n    <p>\n      For <b>Zeppelin</b> notebooks written in <b>Scala</b>, the plugin offers smart navigation, code completion, inspections &amp; quick-fixes,\n      and\n      refactorings inside the\n      notebooks. You can browse, create, and run Zeppelin notebooks without leaving the IDE.\n      If your <b>Zeppelin</b> server is using a <b>Spark</b> cluster, or you configured a Spark cluster separately in the plugin settings,\n      the plugin will allow you to track Spark jobs, see cluster environment and storage information from the IDE.\n      With <a href=\"https://github.com/JetBrains/ztools\">ZTools</a>, you can view details of the variables as you execute your notebooks,\n      and can get smart completion for data frame columns in SQL and Scala.\n    </p>\n    <br>\n    <p>You can also upload, download, and preview large structured files in tabular form, including CVS, Parquet, AVRO, and ORC formats.</p>\n    ","organization":"JetBrains","tags":["Tools integration"],"vendor":"JetBrains","version":"0.3.706","notes":"\n <h2><a></a>Changes in EAP 11</h2>\n<p>Features:</p>\n<ul>\n    <li>Spark-submit support for IntelliJ IDEA, DataGrip and PyCharm</li>\n    <li>Apache Zeppelin support for DataGrip</li>\n    <li>Editable titles of Zeppelin paragraphs</li>\n    <li>Advanced search filtering in the Spark Monitoring tool</li>\n    <li>Zeppelin text output containing tables is automatically converted into the table view</li>\n</ul>\n<p>Usability Problems:</p>\n<ul>\n    <li>Saving and restoring the last saved path for the export feature (charts, tables, and HTML content in Zeppelin note outputs)</li>\n</ul>\n<p>Bug fixes:</p>\n<ul>\n<li>Zeppelin: IDE 2020.1 crashes when displaying Zeppelin note outputs with embedded images</li>\n<li>Zeppelin: It is not possible to connect to the server if /api/version method requires authentication on the server</li>\n<li>Zeppelin: Stop Paragraph Action on pending paragraph stops all paragraphs in the notebook</li>\n<li>Zeppelin: Paragraph numbering in the Structure tool window doesn't match the numbering inside Zeppelin notes</li>\n<li>Zeppelin: Disable attempts to download sources for the dependencies on every IDEA reopening</li>\n<li>Zeppelin: Disable \"open in the browser\" button for local notes</li>\n<li>Zeppelin: Inlay shouldn't be empty after restarting the interpreter</li>\n<li>Spark Monitoring: Fix storage JSON parsing to prevent failures when loading Storages the UI</li>\n<li>Remote FS: Copying a folder inside the Azure container shouldn't clear the files inside that folder</li>\n<li>Remote FS: Files with an unknown content type should be opened in a text mode</li>\n<li>Remote FS: Exception when open files without any extension</li>\n<li>General: Copy and paste files between projects</li>\n<li>HTTP Proxy: An error appears when connecting to Spark and Hadoop with the enabled socks proxy authorization</li>\n<li>HTTP Proxy: Error message for invalid proxy authorizations parameters</li>\n<li>HTTP Proxy: Custom proxy settings shouldn't replace global proxy settings</li>\n</ul>\n<p>The full release notes are available <a href=\"https://youtrack.jetbrains.com/releaseNotes?q=%23%7BBig%20Data%20IDE%7D%20Fixed%20in%20build:%20%7BEAP%2011%7D%20sort%20by:project,%20type,%20votes&amp;title=Big%20Data%20Tools%20EAP%2011\">here</a>.</p>\n","dependencies":["com.intellij.modules.ssh"],"optionalDependencies":["com.intellij.java","org.intellij.plugins.markdown","com.jetbrains.sh","com.jetbrains.plugins.webDeployment","org.intellij.scala","com.intellij.database.ide","com.intellij.database","org.jetbrains.kotlin"],"since":"202.4357","until":"202.*","size":174576550}